Revit 2026 API

# AirCoolingCoilType Enumeration

---

The type of air cooling coil.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AirCoolingCoilType
```
```vb
Public Enumeration AirCoolingCoilType
```
```cpp
public enum class AirCoolingCoilType
```
```fsharp
type AirCoolingCoilType
```

| Member name | Value | Description |
| --- | --- | --- |
| ChilledWater | 1 |  |
| DirectExpansion | 2 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace